---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallAttrWidthParam
source: html/c9073fb7-3044-3eb5-b81b-452eaa2642d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallAttrWidthParam Property

"Width"

## Syntax (C#)
```csharp
public static ForgeTypeId WallAttrWidthParam { get; }
```